Catalogs/ТипыПодписей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Catalog>
		<Properties>
			<Name>ТипыПодписей</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Актуальность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Условие</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УсловияПодписей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеУсловия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Активности</v8:Type>
						<v8:Type>cfg:CatalogRef.ТипыСкидокНаценок</v8:Type>
						<v8:Type>cfg:CatalogRef.ИнформационныеКарты</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеУсловияДоп</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодДействия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПериодыДействия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Текст</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/УсловияПодписей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Enum>
		<Properties>
			<Name>УсловияПодписей</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>БезУсловий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Активность</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДисконтнаяКарта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТипСкидкиНаценки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КоличествоГостей</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сумма</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ТипыПодписей/Ext/ObjectModule.bsl
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	 
	 Если НЕ ЭтоГруппа Тогда
		 Если Актуальность И (НЕ Условие = Перечисления.УсловияПодписей.ДисконтнаяКарта) Тогда
			 __ОбщегоНазначенияСервер.ИзменитьПроверяемыеРеквизиты(ПроверяемыеРеквизиты, "Приоритет");
		 КонецЕсли;
	 КонецЕсли;
	 
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЭтоГруппа Тогда
		
		Если (НЕ Актуальность) ИЛИ (Условие = Перечисления.УсловияПодписей.ДисконтнаяКарта) Тогда
			Приоритет = Неопределено;
			Возврат;
		КонецЕсли;
		
		Если Справочники.ТипыПодписей.ПроверкаУникальностиПриоритета(Приоритет, Ссылка) Тогда
			Сообщить("Значение поля " +""""+ Метаданные.Справочники.ТипыПодписей.Реквизиты.Приоритет.Синоним +""""+ " не уникально", СтатусСообщения.Важное);
			Отказ = Истина;
		КонецЕсли;
		
		Условие = __ОбщегоНазначенияКлиентСервер.ПолучитьНеПустоеЗначение(Условие, ПредопределенноеЗначение("Перечисление.УсловияПодписей.БезУсловий"));
		ЗначениеУсловия = Справочники.ТипыПодписей.ОписаниеТипаЗначенияУсловия(ЭтотОбъект).ПривестиЗначение(ЗначениеУсловия);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Если НЕ ЭтоГруппа Тогда
		Приоритет = Неопределено;
	КонецЕсли;
	
КонецПроцедуры
